[
    {
        "role":"SYSTEMS DESIGN EXPERT",
        "company":"FUJITSU TECHNOLOGY SOLUTIONS (LUXEMBOURG) S.A.",
        "startDate": "MAY 2020",
        "endDate": "present",
        "description" : "My responsibilities include solution development (service start-up, technology and process transformation, ongoing refresh):",
        "responsibilities" : 
        [
            "Support the migration of on-premises solutions to the cloud by assessing the current architecture, functional/non-functional requirements, data sources and interfaces and evaluating the approach (Rehosting, Replatforming, Rearchitecting)",
            "Define, plan and deliver modern solutions and cloud-based enterprise architectures",
            "Realize or lead proof of concepts",
            "Design and deploy proprietary PAAS solutions based on IaC",
            "Help the teams in developing Azure Cloud skills and capabilities."         
        ],
        "technologies": 
        [
            "Azure CLI",
            "Terraform",
            "ARM templates",
            "AKS",
            "Azure DevOps",
            "Azure IAAS",
            "Azure PAAS"
        ]
    },
    {
        "role":"SOLUTION ARCHITECT",
        "company":"RAIFFEISENBANK BULGARIA",
        "startDate": "December 2019",
        "endDate": "April 2020",
        "description" : "My responsibilities include solution development (service start-up, technology and process transformation, ongoing refresh):",
        "responsibilities" : 
        [
            "Examination and interpretation of business requirements",
            "Establishing solution intent",
            "Aligning the solution with the technical architecture",
            "Analyze the impact of the solution (integration, operations, costs, releases) and identification of the potential risks",
            "Maintenance of the Cloud Services Usage matrix (which cloud for which purpose)",
            "Supervision of the built-in quality",
            "Operation within the budgetary framework to validate the financial impact of design decisions",
            "Identification of innovation opportunities",
            "Planning technology roadmaps",
            "Areas of expertise include Public and Private cloud."            
        ],
        "technologies": []
    },
    {
        "role":"SOLUTION LEADER/LEAD OFFERING SOLUTION ARCHITECT",
        "company":"HP/HPE/DXC TECHNOLOGY",
        "startDate": "June 2015",
        "endDate": "November 2019",
        "description" : "My responsibilities include solution development (service start-up, technology and process transformation, ongoing refresh), competitive costing, business case alignment, value proposition. On top of the previous responsibilities, my tasks include:",
        "responsibilities" : 
        [
            "Examination and interpretation of business requirements",
            "Establishing solution intent",
            "Aligning the solution with the technical architecture",
            "Identification of potential technical design risks",
            "Supervision of the built-in quality",
            "Operation within the budgetary framework to validate the financial impact of design decisions",
            "Identification of innovation opportunities",
            "Planning technology roadmaps",
            "Areas of expertise include Public and Private cloud."           
        ],
        "technologies": []
    },
    {
        "role":"Sales support specialist/Deal Delivery assurance",
        "company":"Hewlett-Packard",
        "startDate": "July 2011",
        "endDate": "May 2015",
        "description" : "Responsible for the end to end service management and process and tools solution during pre-sales. Verified that the proposed solution is fit for purpose and in line with the contractual obligation. Contributed to the definition of Service Level Agreements (SLAs), Operational Level Agreements (OLAs) contracts and Key Performance Indicators (KPIs), Quality Performance Indicators and technical proposal. I applied subject matter knowledge to solve common and complex business issues within established guidelines and recommends appropriate alternatives. I worked on problems of diverse complexity and scope. I identified technical risks and challenges the customer should expect to encounter with the solution. Main task:",
        "responsibilities" : 
        [
            "Verify Service requirements",
            "Negotiate SLA / OLA",
            "Maintain and contribute to the creation of the service budget",
            "Obtain stakeholders approval"    
        ],
        "technologies": 
        [
            "HP SM (including all the ITIL modules)",
            "HP Operations Manager",
            "Enterprise Service Portal",
            "Reporting",
            "Run Book Automation",
            "HP Server Automation",
            "multiple case exchange technologies",
            "50 other internal tools logically grouped in the HP Standard Reference Architecture."
        ]
    },
    {
        "role":"Change Manager",
        "company":"Hewlett-Packard",
        "startDate": "December 2007",
        "endDate": "June 2011",
        "description" : "As a Change Manager I had to ensure that projects/change initiatives meet objectives on time and on budget. My focus was on the people side of change – including changes to business processes, systems and technology, job roles and organization structures. The primary responsibility was to create and implement change management strategies and plans that maximized success rate and minimized risk of service disruption. As an MSI change manager I had to execute the above responsibilities on behalf of the customer in his multi-supplier environment and make sure that the suppliers adhere to the agreed process. On top of the regular Change Advisory Boards (CAB) I also chaired operational review meetings. The main goals were:",
        "responsibilities" : 
        [
            "to drive faster change adoption;",
            "to drive higher ultimate utilization and greater proficiency of the changes that impact employees;",
            "to increase benefit realization, value creation, ROI and the achievement of results and outcomes." 
        ],
        "technologies":
        [
            "HP Service Manager",
            "ESL",
            "Visual Basic for Application"
        ]
    },
    {
        "role": "Reporting Specialist",
        "company": "Sofica Group LTD",
        "startDate": "May 2007",
        "endDate": "November 2007",
        "description" : "Contractor at Hewlett Packard. My role was to ensure that all service level agreements (SLAs) across the organization were delivered according to specifications. This includes developing, managing, and administering service management best practices.",
        "responsibilities" : [],
        "technologies":
        [
            "HP Service Manager",
            "ESL",
            "Visual Basic for Application"
        ]
    },
    {
        "role": "Supervisor",
        "company": "Sofica Group LTD",
        "startDate": "July 2005",
        "endDate": "May 2007",
        "description" : "I managed and a team of call centre agents.  I provided assistance by answering agent’s questions,  taking calls that they could not handle.",
        "responsibilities" : [],
        "technologies": []
    }
]
