[
    {
        "role":"SENIOR MANAGER - IT",
        "company":"DELOITTE GLOBAL SERVICES Sàrl",
        "startDate": "April 2023",
        "endDate": "present",
        "description" : "My responsibilities include support the cloud adoption and operations by:",
        "responsibilities" : 
        [
            "#Cloud-Native Application Solutions: architecting, designed, and delivered cloud-native applications, ensuring that these applications leverage the platform scalability, high availability, and efficient resource utilization",
            "#SAAS: Designing innovative and secure proprietary solutions that cater to multiple tenants or customers, providing flexibility and cost-effectiveness to end-users while maintaining isolation and data security for each tenant",
            "#Automation and Infrastructure as Code (IaC): enabling consistent, repeatable, and error-free deployments, reducing manual effort and ensuring better reliability of the infrastructure",
            "Skill Development and Capability Building: By providing training, guidance, and hands-on support, I have empowered teams to efficiently utilize Azure services and best practices"
        ],
        "achievements": [
            "Integrated Infrastructure with IaC: Successfully integrated the infrastructure of three applications using Infrastructure as Code. This consolidation has led to better resource management, cost optimization, and improved overall operational efficiency.",
            "Module Creation and Maintenance: Designed and maintained reusable modules that are instrumental in deploying Infrastructure as Code. These modules ensure consistency across different deployments, streamline the development process, and enable rapid scaling of applications.",
            "Pipeline Development for Landing Zones: created pipelines tailored to different needs, and utilized them across the company landing zones. These pipelines automate the process of building, testing, and deploying applications in their respective landing zones, improving the development lifecycle and reducing time-to-market.",
            "Develop the HashiCorp Terraform adoption framework."
        ],
        "technologies": 
        [
            "openToFu/Terraform",
            "Azure DevOps",
            "Azure Entra ID",
            "Azure CLI",
            "ARM templates",
            "Azure IAAS",
            "Azure PAAS",
            "Kusto"
        ]
    },
    {
        "role":"SYSTEMS DESIGN EXPERT",
        "company":"FUJITSU TECHNOLOGY SOLUTIONS (LUXEMBOURG) S.A.",
        "startDate": "May 2020",
        "endDate": "March 2023",
        "description" : "My responsibilities include solution development (service start-up, technology, and process transformation, ongoing refresh):",
        "responsibilities" : 
        [
            "Support the migration of on-premises solutions to the cloud by assessing the current architecture, functional/non-functional requirements, data sources and interfaces and evaluating the approach (Rehosting, Replatforming, Rearchitecting)",
            "Define, plan and deliver modern solutions and cloud-based enterprise architectures",
            "Realize or lead proof of concepts",
            "Design and deploy proprietary PAAS solutions based on IaC",
            "Help the teams in developing Azure Cloud skills and capabilities."         
        ],
        "achievements": [
            "Created an analytical and reporting solution based on Power BI, Power Query, Azure DevOps.",
            "Created and maintained 2 basis repositories used for IaC deployments that increased the standardization of the delivery to ~65%",
            "Created 4 types of pipelines that were used in 15 landing zones"
        ],
        "technologies": 
        [
            "Azure CLI",
            "Terraform",
            "ARM templates",
            "AKS",
            "Azure DevOps",
            "Azure IAAS",
            "Azure PAAS"
        ]
    },
    {
        "role":"SOLUTION ARCHITECT",
        "company":"RAIFFEISENBANK BULGARIA",
        "startDate": "December 2019",
        "endDate": "April 2020",
        "description" : "My responsibilities include solution development (service start-up, technology and process transformation, ongoing refresh):",
        "responsibilities" : 
        [
            "Examination and interpretation of business requirements",
            "Establishing solution intent",
            "Aligning the solution with the technical architecture",
            "Analyze the impact of the solution (integration, operations, costs, releases) and identification of the potential risks",
            "Maintenance of the Cloud Services Usage matrix (which cloud for which purpose)",
            "Supervision of the built-in quality",
            "Operation within the budgetary framework to validate the financial impact of design decisions",
            "Identification of innovation opportunities",
            "Planning technology roadmaps",
            "Areas of expertise include Public and Private cloud."            
        ],
        "achievements": ["Completed projects concerning regulatory compliance and anti-fraud."],
        "technologies": []
    },
    {
        "role":"SOLUTION LEADER/LEAD OFFERING SOLUTION ARCHITECT",
        "company":"HP/HPE/DXC TECHNOLOGY",
        "startDate": "June 2015",
        "endDate": "November 2019",
        "description" : "My responsibilities include solution development (service start-up, technology and process transformation, ongoing refresh), competitive costing, business case alignment, and value proposition. On top of the previous responsibilities, my tasks included:",
        "responsibilities" : 
        [
            "Examination and interpretation of business requirements",
            "Establishing solution intent",
            "Aligning the solution with the technical architecture",
            "Identification of potential technical design risks",
            "Supervision of the built-in quality",
            "Operation within the budgetary framework to validate the financial impact of design decisions",
            "Identification of innovation opportunities",
            "Planning technology roadmaps",
            "Areas of expertise include Public and Private cloud."           
        ],
        "achievements": ["Worked on ~ 40 opportunities", "Created 7 custom costing and risk assessment solutions that were reused in a team of 10 solution architects"],
        "technologies": ["Private and Public clouds, in-house automation"]
    },
    {
        "role":"Sales support specialist/Deal Delivery assurance",
        "company":"Hewlett-Packard",
        "startDate": "July 2011",
        "endDate": "May 2015",
        "description" : "Responsible for the end-to-end service management and process and tools solution during pre-sales. Verified that the proposed solution is fit for purpose and in line with the contractual obligation. Contributed to the definition of Service Level Agreements (SLAs), Operational Level Agreements (OLAs) contracts and Key Performance Indicators (KPIs), Quality Performance Indicators, and technical proposals. I applied subject matter knowledge to solve common and complex business issues within established guidelines and recommends appropriate alternatives. I worked on problems of diverse complexity and scope. I identified technical risks and challenges the customer should expect to encounter with the solution. Main task:",
        "responsibilities" : 
        [
            "Verify Service requirements",
            "Negotiate SLA / OLA",
            "Maintain and contribute to the creation of the service budget",
            "Obtain stakeholders approval"    
        ],
        "achievements": [
            "Worked on ~ 130 opportunities - and never had a customer rejection of the service line.",
            "Integrated presales tools",
            "Generated reporting and analysis that was instrumental for higher management decision-making."
        ],
        "technologies": 
        [
            "HP SM (including all the ITIL modules)",
            "HP Operations Manager",
            "Enterprise Service Portal",
            "Reporting",
            "Run Book Automation",
            "HP Server Automation",
            "multiple case exchange technologies",
            "50 other internal tools logically grouped in the HP Standard Reference Architecture."
        ]
    },
    {
        "role":"Change Manager",
        "company":"Hewlett-Packard",
        "startDate": "December 2007",
        "endDate": "June 2011",
        "description" : "As a Change Manager I had to ensure that projects/change initiatives meet objectives on time and on budget. My focus was on the people side of change – including changes to business processes, systems and technology, job roles and organization structures. The primary responsibility was to create and implement change management strategies and plans that maximized success rate and minimized risk of service disruption. As an MSI change manager I had to execute the above responsibilities on behalf of the customer in his multi-supplier environment and make sure that the suppliers adhere to the agreed process. On top of the regular Change Advisory Boards (CAB) I also chaired operational review meetings. The main goals were:",
        "responsibilities" : 
        [
            "to drive faster change adoption;",
            "to drive higher ultimate utilization and greater proficiency of the changes that impact employees;",
            "to increase benefit realization, value creation, ROI and the achievement of results and outcomes." 
        ],
        "achievements": [
            "Automated the reporting that reduced the time to generate from 4 hours to under 5 minutes - on a daily basis.",
            "Automated the Technical Advisory Board (TAB) and Change Advisory Board agenda verification and generation. On top of the time saved this increased the quality and reduced the errors from ~ 10 per week to 1 per month.",
            "Designed, implemented and supported a combined Operational and Decision support system that shared the same set of data. This facilitated the tracking and improvement of 5 to 25 KPIs and provided historical data analysis.",
            "Facilitated the integration of various Service management tools."
        ],
        "technologies":
        [
            "HP Service Manager",
            "ESL",
            "Visual Basic for Application"
        ]
    },
    {
        "role": "Reporting Specialist",
        "company": "Sofica Group LTD",
        "startDate": "May 2007",
        "endDate": "November 2007",
        "description" : "Contractor at Hewlett Packard. My role was to ensure that all service level agreements (SLAs) across the organization were delivered according to specifications. This includes developing, managing, and administering service management best practices.",
        "responsibilities" : [],
        "achievements": [
            "Automated the generation of around 70 reports that reduced the time to produce them from three weeks to 4 hours and increased the quality and reliability.",
            "This allowed the time previously used for data gathering and aggregation to be devoted to analysis, which increased the quality of the service and the customer satisfaction."
        ],
        "technologies":
        [
            "HP Service Manager",
            "ESAR",
            "ESL",
            "Visual Basic for Application (VBA)"
        ]
    },
    {
        "role": "Supervisor",
        "company": "Sofica Group LTD",
        "startDate": "July 2005",
        "endDate": "May 2007",
        "description" : "I managed and a team of call center agents.  I provided assistance by answering agent’s questions,  taking calls that they could not handle.",
        "responsibilities" : [],
        "achievements": ["Designed the algorithm that presented the scripts. This reduced the effort required by the agents 10x times."],
        "technologies": ["Visual Basic for Application (VBA)", "SQL"]
    }
]
